Resources/Template_Cases/splashThings/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ********* Domain *********
scale 1.0;
 
vertices
(
    (-7.0 -5.0 -1.0)
    (19.0 -5.0 -1.0)
    (19.0 5.0 -1.0)
    (-7.0 5.0 -1.0)
    (-7.0 -5.0 9.0)
    (19.0 -5.0 9.0)
    (19.0 5.0 9.0)
    (-7.0 5.0 9.0)
);
 
blocks
(
    hex (0 1 2 3 4 5 6 7) (40 16 16) simpleGrading (1 1 1)
);
 
edges
(
);
 
boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    front
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
);
mergePatchPairs
(
);

// ************************************************************************* //
