Resources/Template_Cases/splashThings/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1e-06;

boundaryField 
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type fixedValue;
        value uniform 3.7500000000000004;
    }
    
    outlet
    {
        type zeroGradient;
        value uniform 1e-06;
    }
    
    front
    {
        type symmetry;
    }
    
    back
    {
        type symmetry;
    }
    
    bottom
    {
        type symmetry;
    }
    
    top
    {
        type symmetry;
    }
    
    "geom.*"
    {
        type omegaWallFunction;
        value  $internalField;
    }
    
}